/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   validate_arg.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: takkatao <takkatao@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/16 16:57:11 by takkatao          #+#    #+#             */
/*   Updated: 2022/05/17 14:34:56 by takkatao         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "io.h"

// TODO:
// - 出力形式が要件と違うのでputerrを修正する。
void	validate_arg(int argc)
{
	if (argc != 2)
		puterr_exit("", "Error", EXIT_FAILURE);
}
